# Examples with Pandas

In [1]:
import pandas as pd

In [2]:
titanicDf = pd.read_csv('./titanic.csv')

In [32]:
# List Comprehension in Python
names = ['Igor','Firas','Karan','Zara']
names[0:3]

['Igor', 'Firas', 'Karan']

In [5]:
titanicDf.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [34]:
# For more examples,
# https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.iloc.html?highlight=iloc#pandas.DataFrame.iloc
titanicDf.loc[0:4, 'Sex':'Age']

      Sex   Age
0    male  22.0
1  female  38.0
2  female  26.0
3  female  35.0
4    male  35.0

In [49]:
titanicDf.iloc[0:4, 5].sort_values(ascending=False)

1    38.0
3    35.0
2    26.0
0    22.0
Name: Age, dtype: float64

In [20]:
# Filtering a dataframe with conditions
cond1 = titanicDf['Age'] >= 35
cond2 = titanicDf['Age'] <= 45

titanicDf[cond1 & cond2].loc[:, 'Name']

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
13                           Andersson, Mr. Anders Johan
20                                  Fynney, Mr. Joseph J
                             ...
854        Carter, Mrs. Ernest Courtenay (Lilian Hughes)
856           Wick, Mrs. George Dennick (Mary Hitchcock)
860                              Hansen, Mr. Claus Peter
865                             Bystrom, Mrs. (Karolina)
885                 Rice, Mrs. William (Margaret Norton)
Name: Name, Length: 132, dtype: object

In [ ]:
# Review of Data Structures

# Lisr
# a = ['Alshayma','Dany','Mohammad']
# a[0]

# Dictionary
# b = {
#     'ceo': 'Alshayma',
#     'cto': 'Dany',
#     'cfo': 'Mohammad'
# }
# b['ceo']

# Tuple
# c = ('Mon','Tue','Wed','Thu','Fri','Sat','Sun')
# c[0]

In [30]:
# Descriptive stats for rows 0 to 4
titanicDf[0:4].describe()

# Descriptive stats for rows 0 to 4 (Age only)
titanicDf[0:4].describe()['Age']

count     4.00
mean     30.25
std       7.50
min      22.00
25%      25.00
50%      30.50
75%      35.75
max      38.00
Name: Age, dtype: float64

In [28]:
titanicDf['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64